Repository: SmAaMyA/dart-flutter-template
Catalog: lib/src/localization/app_*.arb
Languages: th

# appTitle
source: Flutter Application Template
th: แม่แบบแอปพลิเคชัน Flutter

# greeting
source: Hello
th: ยินดีต้อนรับ

source: Home
th: หน้าหลัก

# homeMenuTooltip
source: Go to home page
th: ไปที่หน้าหลัก

# homeContent
source: This is the home page.
th: นี่คือหน้าหลัก

source: Login
th: เข้าสู่ระบบ

# loginTooltip
source: Login
th: เข้าสู่ระบบ

source: Logout
th: ออกจากระบบ

# logoutTooltip
source: Logout
th: ออกจากระบบ

source: Username
th: ชื่อผู้ใช้

source: Password
th: รหัสผ่าน

source: Cancel
th: ยกเลิก

source: Trade
th: ซื้อขาย

# tradeMenuTooltip
source: Go to trade page
th: ไปที่หน้าซื้อขาย

# tradeContent
source: Here you can trade.
th: คุณสามารถซื้อขายได้ที่นี่

source: Chat Rooms
th: ห้องแชท

# chatRoomsMenuTooltip
source: Go to chat room page
th: ไปที่หน้ารายชื่อห้องแชท

# chatRoomsContent
source: Here you can see the chat rooms.
th: ที่นี่คุณสามารถดูห้องแชทได้

source: Chat
th: แชท

# chatMenuTooltip
source: Go to chat page
th: ไปที่หน้าแชท

# chatContent
source: Here you can chat with other users.
th: ที่นี่คุณสามารถแชทกับผู้ใช้คนอื่นได้

# chatBoxPlaceholder
source: Enter your message...
th: พิมพ์ข้อความของคุณ...

source: Menu
th: เมนู

# menuMenuTooltip
source: Go to menu page
th: ไปที่หน้าเมนู

# menuContent
source: Here you can see the menu.
th: นี่คือเนื้อหาหน้าเมนู

source: Change Information
th: เปลี่ยนแปลงข้อมูล

# changeInformationContent
source: Here you can change your information.
th: คุณสามารถเปลี่ยนแปลงข้อมูลของคุณได้จากหน้านี้

source: Suitability Test
th: การทดสอบความเหมาะสมในการลงทุน

# suitabilityTestContent
source: Here you can take the suitability test.
th: คุณสามารถทำการทดสอบความเหมาะสมในการลงทุนได้จากหน้านี้

source: History
th: ประวัติ

# historyContent
source: Here you can see your history.
th: คุณสามารถดูประวัติของคุณได้จากหน้านี้

source: Settings
th: การตั้งค่า

# settingContent
source: Here you can change your settings.
th: คุณสามารถเปลี่ยนแปลงการตั้งค่าของคุณได้จากหน้านี้

source: Contact Us
th: ติดต่อเรา

# contactUsMenuTooltip
source: Go to contact us page
th: ไปที่หน้าติดต่อเรา

# contactUsDescription
source: You can contact us via these channels.
th: คุณสามารถติดต่อเราได้ผ่านช่องทางที่ระบุข้างล่างนี้

source: Email
th: อีเมล

source: Phone
th: โทรศัพท์

source: Working hours
th: เวลาทำการ

source: Branches
th: สาขา

source: Social media
th: โซเชียลมีเดีย

# failLaunchUrl
source: Could not launch
th: ไม่สามารถเปิดลิงค์

# lineMenuTooltip
source: Go to LINE application
th: ไปที่แอปพลิเคชัน LINE

# facebookMenuTooltip
source: Go to Facebook application
th: ไปที่แอปพลิเคชัน Facebook

# youtubeMenuTooltip
source: Go to YouTube application
th: ไปที่แอปพลิเคชัน YouTube

# tiktokMenuTooltip
source: Go to TikTok application
th: ไปที่แอปพลิเคชัน TikTok

# languageMenuName
source: Language
th: ภาษา

# languageDropdownToottip
source: Change language
th: เปลี่ยนภาษา

# toggleThemeMenuName
source: Theme
th: ธีม

# toggleThemeTooltip
source: Toggle Theme
th: สลับธีม

# notificationTooltip
source: Show notifications
th: แสดงการแจ้งเตือน

# menuTooltip
source: Show menu
th: แสดงเมนู
